_sdaiCreateRepository(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Creates a new repository with desired name inside current session.
\param session [in] session instance
\param name [in] new repository name
\returns instance of the created repository, in other case NULL